step-by-step/030-populate-database/020-soap/1000-vlan-ресурсы/0400.xml

<?xml version="1.0" ?>
<!-- Создаем VLAN-ресурс -->
<S:Envelope xmlns:S="http://schemas.xmlsoap.org/soap/envelope/">
    <S:Header>
        <auth xmlns="http://ws.base.kernel.bgbilling.bitel.ru/" pswd="admin" user="admin"></auth>
    </S:Header>
    <S:Body>
        <ns5:vlanResourceUpdate xmlns:common="http://common.bitel.ru"
                                xmlns:ns5="http://common.resource.inventory.systems.oss.bitel.ru/"
                                xmlns:xs="http://www.w3.org/2001/XMLSchema"
                                xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
            <vlan xmlns="" id="-1" title="SPVID 0900 CVIDs" vlanFrom="10" vlanTo="4000">
                <categoryId>2</categoryId>
                <comment></comment>
            </vlan>
        </ns5:vlanResourceUpdate>
    </S:Body>
</S:Envelope>
